static/searching.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Searching</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2009-06-23 13:33:28 CEST"/>
<meta name="author" content="Andreas Rottmann"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="common.css" type="text/css" />
                 <link rel="stylesheet" href="docs.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Searching</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Quickstart </h2>
<div class="outline-text-2" id="text-1">


<p>
You can a number of search terms, which are substring-matched against
the irclog messages (the nick of the person issuing the message is not
included in the search). All terms (delimited by whitespace) are
linked with logical <i>and</i>, so the search <code>foo bar</code> will find all
messages that contain <i>both</i> <code>foo</code> and <code>bar</code>. You can use "advanced"
features using parentheses, like <code>(rx "foo|bar")</code>, which will search
for the <a href="http://en.wikipedia.org/wiki/Regular_expression">regular expression</a> <code>foo|bar</code>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Details </h2>
<div class="outline-text-2" id="text-2">


<p>
A search always has a "base date", and a number of days it reaches
backwards; both have default values:
</p>
<ul>
<li>
The "base date" defaults to the current date, if no <code>date</code> query
option is given in the URL, which is the case when you initially
enter a channel activity overview page. If you use the navigation
links or the "pin" links presented for each day to navigate to
another day, that changes the base date to the corresponding day.

</li>
<li>
The number of days searched by default is 14, this option can be
changed in the configuration file.

</li>
</ul>

<p>The phrase (interpreted as character string) entered into the search
field is parsed into a list of "search parameters" according to the
following rules:
</p>
<ul>
<li>
As long as possible, an item is consumed from the string by using
the Scheme procedure for reading a datum (<a href="http://www.schemers.org/Documents/Standards/R5RS/HTML/r5rs-Z-H-9.html#%_idx_612">R5RS read</a>, <a href="http://www.r6rs.org/final/html/r6rs-lib/r6rs-lib-Z-H-9.html#node_idx_708">R6RS get-datum</a>). If parsing fails at some point, the entire remainder of
the string is consumed a single item. This step results in a list of
Scheme datums. For example:

<ul>
<li>
<code>foo bar "hello world" 42</code> results in the list <code>(foo bar "hello     world" 42)</code>.

</li>
<li>
<code>(date "2008-10-26") (days 42) foo) 123</code> results in the list
<code>((date "2008-10-26") (days 42) foo ") 123")</code>; note that the
charcters starting from the mismatched closing paren are
accumulated into a single string, as the Scheme parser will fail a
that point.

</li>
</ul>
</li>
<li>
The list resulting from the previous step is broken into two parts:
"search parameters" and "search expressions". A search parameter is
always a list, with the first item indicating the parameter
name. The following search paramaters are available:

<dl>
<dt><code>date</code></dt><dd>
Specifies the date that the search will start at. This
parameter must be written as <code>(date "YYYY-mm-dd")</code>, i.e. the date
must be written as a string in the ISO date notation. As noted
above, the date defaults to the first day displayed on the channel
overview page.

</dd>
<dt><code>days</code></dt><dd>
Specifies the number of days the search should
cover. Note that the number of days is specifying how far to
search <b>back</b>, so given a base date of 2008-12-05, and 3 days to
search, the search starts at 2008-12-05, 24:00 hours and covers
the time back to 2008-12-03, 0:00 hours.

<p>
A list of search expressions and how they are used for matching
follows:
</p>
</dd>
<dt><i>strings</i></dt><dd>
A string indicates a substring match, i.e. there is a
match if the message contains the string given at any position.

</dd>
<dt><i>symbols</i></dt><dd>
For convinience, symbols are converted to strings, and
the resulting string is used as above, as a substring match.

</dd>
<dt><code>(rx &lt;expr&gt;)</code></dt><dd>
A regular expresssion match; <code>&lt;expr&gt;</code> must be
either an extended POSIX regular expression string or a symbolic
regular expression (SRE). For the exact syntax that can be used,
see the <a href="http://synthcode.com/scheme/irregex/">irregex manual</a>.

</dd>
</dl>

<p>All search expressions specified must match for a specific log entry
for it to be considered a search hit; in other words: The search
expressions are combined using <i>logical and</i>.
</p>
<p>
There is currently no way to specify a <i>logical or</i> relationship, or
nesting of search expressions, but this is a planned feature.
</p></li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Andreas Rottmann
<a href="mailto:a.rottmann@gmx.at">&lt;a.rottmann@gmx.at&gt;</a>
</p>
<p class="date"> Date: 2009-06-23 13:33:28 CEST</p>
<p class="creator">HTML generated by org-mode 6.27a in emacs 23</p>
</div>
</div>
</body>
</html>
